import { useRef } from "react";
import { Cover } from "components/Cover";
import { Heading } from "components/Heading";
import gsap from "gsap";
import { useGSAP } from "@gsap/react";
import { MorphSVGPlugin } from "gsap/MorphSVGPlugin";

gsap.registerPlugin(useGSAP, MorphSVGPlugin);

export const HeroHome = ({ blocks }) => {
  const container = useRef(null);
  const initialD = useRef("");

  const coverBlock = blocks?.innerBlocks?.[0];
  const headingBlock = coverBlock?.innerBlocks?.[0];
  const background = {
    backgroundVideo: coverBlock?.attributes?.url
      ? { url: coverBlock.attributes.url }
      : null,
    backgroundColor: coverBlock?.attributes?.customOverlayColor || null,
  };
  useGSAP(
    () => {
      const from = container.current?.querySelector("#morphFrom");
      const to = container.current?.querySelector("#morphTo");
      if (!from || !to) return;

      if (!initialD.current) initialD.current = from.getAttribute("d") || "";

      // reset iniziale, così riparte sempre quando rientri nella pagina
      gsap.set(from, { attr: { d: initialD.current } });

      gsap.to(from, {
        duration: 6,
        ease: "power2.inOut",
        morphSVG: "#morphTo",
      });
    },
    { scope: container },
  );
  return (
    <section ref={container} className="w-full h-screen relative">
      <div
        className="pointer-events-none absolute inset-0 z-10"
        style={{
          background:
            "linear-gradient(179.96deg, rgba(0, 0, 0, 0) 0.04%, rgba(0, 0, 0, 0.26) 70.31%)",
          mixBlendMode: "darken",
        }}
      ></div>
      <Cover background={background}>
        <div className="flex flex-col gap-5 lg:gap-10">
          <div className="mx-auto">
            <svg
              id="a"
              xmlns="http://www.w3.org/2000/svg"
              version="1.1"
              viewBox="0 0 1417.3 850.4"
              width="156.5px"
              height="101.86px"
            >
              <g>
                <path
                  className="fill-white"
                  d="M234.5,753.4c0,33-19.4,55.2-57.3,55.2h-60.7l5-36.7h1.7c12.4,20.5,33.6,31.1,58.1,31.2,22.7,0,31.7-14.1,31.7-31.6,0-50.3-98-40.1-98-109.7s15.9-47.1,50.9-47.1h60.7l-5,36.7h-1.6c-12.4-20.5-33.6-31.1-58.1-31.2-18.9,0-28,10.2-28,26.8,0,39.8,100.7,37.2,100.7,106.5h0Z"
                />
                <path
                  className="fill-white"
                  d="M358,790.6c0,9.7,1.6,13.9,5.2,16.3v2h-34.3v-91c0-21.1-2.3-37.6-24.2-37.6s-30.8,1.3-30.8,15.9c0,24.2,55.7,12.4,54.6,71.1-.4,21.5-11.3,43.2-40.1,43.2-55.9,0-61.5-84.2,13.5-77.7v2.5c-39.9-2.8-35.4,68-7,68s27.8-15.8,28.2-34.5c1.3-58.1-62.2-34.3-62.2-65.7s31.7-27.7,44.8-27.7c19.5,0,52.3,12,52.3,46.1v69h0Z"
                />
                <path
                  className="fill-white"
                  d="M497,790.6c0,9.7,1.6,13.9,5.2,16.4v2h-39.5v-2c3.5-2.5,5.2-6.7,5.2-16.4v-62.6c.2-31.5-4.9-43-17.2-43s-23.6,11.3-34.9,40.2v65.5c0,9.7,1.6,13.9,5.2,16.4v2h-39.5v-2c3.5-2.5,5.2-6.7,5.2-16.4v-95.2c0-5-5.7-9.1-11.9-.5l-1.1-3.8c8.7-23.3,42.1-19.3,42.1,8.5l-.5,14.8c13.5-33.9,30.3-38.9,46.9-38.9s36,17.3,35,40.3l-.3,74.8h0Z"
                />
                <path
                  className="fill-white"
                  d="M605,770.6c-4.5,26.1-19.5,39.9-39,39.9s-44.4-11.5-44.4-48.8v-84h-13.9v-2.2c20,0,32.2-19.3,32.2-38h23.5c0,24.7-26.1,37.2-40.3,38h55.4v2.2h-27.8v88.2c0,27.7,11.4,36.2,21.8,36.2s27.2-10.7,31.4-32l1.2.6h0Z"
                />
                <path
                  className="fill-white"
                  d="M724.6,790.6c0,9.7,1.6,13.9,5.2,16.3v2h-34.3v-91c0-21.1-2.3-37.6-24.2-37.6s-30.8,1.3-30.8,15.9c0,24.2,55.7,12.4,54.6,71.1-.4,21.5-11.3,43.2-40.1,43.2-55.9,0-61.5-84.2,13.5-77.7v2.5c-39.9-2.8-35.4,68-7,68s27.8-15.8,28.2-34.5c1.3-58.1-62.2-34.3-62.2-65.7s31.7-27.7,44.8-27.7c19.5,0,52.3,12,52.3,46.1v69h0Z"
                />
                <path
                  className="fill-white"
                  d="M909.8,753.4c0,33-19.4,55.2-57.3,55.2h-60.7l5-36.7h1.7c12.4,20.5,33.6,31.1,58.1,31.2,22.7,0,31.7-14.1,31.7-31.6,0-50.3-98-40.1-98-109.7s15.9-47.1,50.9-47.1h60.7l-5,36.7h-1.7c-12.4-20.5-33.6-31.1-58.1-31.2-18.8,0-28,10.2-28,26.8,0,39.8,100.7,37.2,100.7,106.5h0Z"
                />
                <path
                  className="fill-white"
                  d="M1045.2,737.1c0,44.4-32.2,73.5-63.8,73.5s-58.8-22.7-58.8-61.5,32.2-73.5,63.7-73.5,58.8,23.3,58.8,61.5h0ZM1014.8,728.2c-8.2-33.3-23.8-53.8-45.7-44.7-26.2,10.8-24.5,40.9-16.3,74.4,8.2,33.3,23.8,52.9,46,44.6,24.7-9.2,24.2-40.7,16-74.2h0Z"
                />
                <path
                  className="fill-white"
                  d="M1095.8,677.7v112.8c0,9.7,1.7,13.9,5.2,16.4v2h-39.5v-2c3.5-2.5,5.2-6.7,5.2-16.4v-90.7c0-15-4.7-22.2-13.9-22.2v-2.2h42.8c-26,0-39.8-14.4-39.8-33s18.6-33.5,41.9-33.5,17.7,0,32.7,0l-4,26.4h-1.4c-5.7-16.6-16.7-22.6-27.3-22.2-26.2,0-21.7,62.3,8.8,62.3h34.8v2.2h-45.4,0Z"
                />
                <path
                  className="fill-white"
                  d="M1171.8,806.9v2h-39.5v-2c3.5-2.5,5.2-6.7,5.2-16.4v-95.5c0-5-5.7-9.1-11.9-.5l-1.1-3.8c8.7-23.3,42.2-19.3,42.1,8.5v91.3c0,9.7,1.7,13.9,5.2,16.4h0ZM1151.1,633.5c17.5,0,17.5,28,0,28s-18.1-28,0-28Z"
                />
                <path
                  className="fill-white"
                  d="M1297.2,790.6c0,9.7,1.6,13.9,5.2,16.3v2h-34.3v-91c0-21.1-2.3-37.6-24.2-37.6s-30.8,1.3-30.8,15.9c0,24.2,55.7,12.4,54.6,71.1-.4,21.5-11.3,43.2-40.1,43.2-55.9,0-61.5-84.2,13.5-77.7v2.5c-39.9-2.8-35.4,68-7,68s27.8-15.8,28.2-34.5c1.3-58.1-62.2-34.3-62.2-65.7s31.7-27.7,44.8-27.7c19.5,0,52.3,12,52.3,46.1v69h0Z"
                />
              </g>
              <g>
                <path
                  className="fill-white"
                  d="M601.5,474.2c-9.2,1.1-11.9,2.3-17.1,15.3-4.1,10.2-20.2,49-29.3,72h-6.6c-5.4-14.9-21.4-57.4-28-74.2-4.2-10.4-6.2-12.3-15-13.2v-4.7h40v4.7c-10.3,1.3-10.5,2.5-8.4,8.1,4,11.2,14.4,39.5,20.5,55.6,8-19.2,16.1-39.5,20.5-51.5,3.3-9.1,2.1-10.9-9.5-12.2v-4.7h32.8v4.7h0Z"
                />
                <path
                  className="fill-white"
                  d="M607.2,560v-4.7c10.9-1.1,12.1-1.8,12.1-13.6v-53.9c0-11.8-1.3-12.7-12.1-13.7v-4.7h41v4.7c-10.8,1.1-12.1,1.9-12.1,13.7v53.9c0,11.7,1.2,12.4,12.1,13.6v4.7h-41Z"
                />
                <path
                  className="fill-white"
                  d="M733.3,536c-1,5.4-5,20.1-6.3,24h-67.6v-4.7c12.4-1,13.5-1.9,13.5-13.6v-53.9c0-11.8-1.4-12.7-12.1-13.6v-4.7h41.3v4.7c-11,1-12.4,1.9-12.4,13.6v55c0,8,.6,10.9,8.3,11,.2,0,7.9.1,8.6.1,7.7,0,9.7-1.4,13-5,2.9-3.1,6.3-8.9,8.7-14.4l5,1.5h0Z"
                />
                <path
                  className="fill-white"
                  d="M813.1,536c-1,5.4-5,20.1-6.3,24h-67.6v-4.7c12.4-1,13.5-1.9,13.5-13.6v-53.9c0-11.8-1.4-12.7-12.1-13.6v-4.7h41.3v4.7c-11,1-12.4,1.9-12.4,13.6v55c0,8,.6,10.9,8.3,11,.2,0,7.9.1,8.6.1,7.7,0,9.7-1.4,13-5,2.9-3.1,6.3-8.9,8.7-14.4l5,1.5h0Z"
                />
                <path
                  className="fill-white"
                  d="M874.3,560v-4.7c8.9-1.2,9.3-2.7,7.3-8.4-1.5-4.6-4-11.1-6.3-17.8h-28.2c-1.8,5-3.8,10.3-5.4,15.2-3,8.9-.1,10,11,11.1v4.7h-33.6v-4.7c8.8-1.1,11-2.3,15.8-14.3l28.9-72.4,5.9-1.1c8.9,24.1,18.4,49.4,27.3,73,4.9,12.7,6.2,13.7,15.5,14.8v4.7h-38.3ZM861.4,490.8c-4.2,10.7-8.4,21.2-12.1,31.7h23.5l-11.4-31.7h0Z"
                />
              </g>
              <path
                className="fill-orangelogo"
                d="M781,328.4c-35.5,4.7-50,60.2-50,32.5,0-79.2,154.2-34.7,154.2-144.3s-24.9-74.2-80-74.2h-13.4c-25,0-47.1,16.1-54.9,39.8h0l-28,141-28-141h0c-7.7-23.8-29.9-39.8-54.9-39.8h-13.4c-55.1,0-80,38.8-80,74.2,0,109.6,154.3,65.1,154.3,144.3s-14.6-27.3-50-32.5c-93.8-13.9-101.8,91.1-101.8,91.1h95.5c38.2,0,64.5-2.5,78.3-26.6,13.8,24,40.1,26.6,78.3,26.6h95.5s-6.4-103.8-101.8-91.1h0Z"
              />
              <path
                className="fill-orangelogo"
                d="M709.1,156.4c0-37.8-20.5-58.3-58.3-58.3,37.8,0,58.3-20.5,58.3-58.3,0,37.8,20.5,58.3,58.3,58.3-37.8,0-58.3,20.5-58.3,58.3Z"
              />
            </svg>
          </div>
          {headingBlock && (
            <Heading
              level={headingBlock.attributes?.level}
              content={headingBlock.attributes?.content}
              className="font-montecatini px-10 text-center text-white font-normal text-5xl lg:text-7xl"
            ></Heading>
          )}
        </div>
      </Cover>
      <div className="absolute w-full left-0 bottom-0 z-20">
        <svg
          id="Livello_1"
          xmlns="http://www.w3.org/2000/svg"
          version="1.1"
          viewBox="0 0 1280 321"
          className="translate-y-1/2"
        >
          <path
            id="morphFrom"
            className="fill-white"
            d="M639.3,319.9c0-103.9-56.7-160.1-161.3-160.1,104.6,0,161.3-56.3,161.3-160.1,0,103.9,56.7,160.1,161.3,160.1-104.6,0-161.3,56.3-161.3,160.1Z"
          />
          <path
            id="morphTo"
            className="fill-white"
            style={{visibility: "hidden"}}
            d="M639.3,319.9c0-103.9-532.2-160.1-636.8-160.1,104.6,0,636.8.3,636.8.3,0,0,532.2-.3,636.8-.3-104.6,0-636.8,56.3-636.8,160.1Z"
          />
        </svg>
      </div>
    </section>
  );
};
